controllers/TestsController.php

    public function actionIndex()
    {
      $query = Test::find()->select(['id', 'title', 'description'])->orderBy('id DESC');
      $pages = new Pagination(['totalCount' => $query->count(), 'pageSize' => 2, 'pageSizeParam' => false, 'forcePageParam' => false]);
      $tests = $query->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT COUNT(*) FROM `test`
SELECT `id`, `title`, `description` FROM `test` ORDER BY `id` DESC LIMIT 2