models/UserIdentity.php

SELECT * FROM `user` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        return static::findOne($id);

SELECT * FROM `user` WHERE `login`='admin'
---
    public static function findByLogin($login)
    {
        return static::findOne(['login' => $login]);